Repository: kurtfast/foaea-laeoef-r
Catalog: FOAEA3.Resources/ErrorResource.*.resx
Languages: fr

# ACCOUNT_PASSWORD_CHANGE_REQUIRED
source: Password must be reset
fr: Le mot de passe doit être réinitialisé.

# CANT_CREATE_APPLICATION_ALREADY_EXISTS
source: Application already exists! Cannot be created.
fr: Application existe déjà! Ne peux créer.

# CANT_SET_VALUE_ONCE_SET
source: Can't set once a value has already been set.
fr: Ne peux ré-assigner une valeur une fois assignée.

# CANT_UPDATE_APPLICATION_DOES_NOT_EXISTS
source: Application does not exists! Cannot be updated.
fr: Application n'existe pas! Ne peux pas mettre à jour.

# COMMENTS_TOO_LONG_500
source: Comment field is too long. Maximum length is 500 characters.
fr: Commentaire trop long; le maximum permis est de 500 caractères.

source: Debtor surname cannot be XXXX
fr: Nom de famille du débiteur ne peux pas être XXXX

# DEBTOR_SURNAME_CANNOT_CONTAIN_SPACE
source: First three characters of Debtor Surname cannot contain a space
fr: Les 3 premiers caractères du nom du débiteur ne peuvent pas contenir des espaces.

# DEBTOR_SURNAME_LENGTH_3
source: Debtor Surname length must be 3 or greater
fr: Le nom de famille du débiteur doit avoir 3 caractères ou plus

# ERROR_COMMENTS_TOO_LONG
source: Comments too long.
fr: Commentaires trop long.

# ERROR_EMAIL_FORMAT
source: Must match someone@somewhere.abc
fr: Doit correspondre à quelquun@quelquepart.abc

# ERROR_INVALID_EMAIL
source: Invalid email address
fr: Adresse courriel incorrecte

# ERROR_INVALID_PHONE
source: Invalid phone number
fr: Numéro de téléphone incorrecte

# ERROR_LANGUAGE_MISSING
source: Please choose a language preference
fr: SVP Choisissez le language préferé

# ERROR_MISSING_PHONE_AREACODE
source: Please enter an area number
fr: SVP Entrez l'indicatif régional

# ERROR_MISSING_PHONE_NUMBER
source: Please enter a telephone number
fr: SVP Entrez un numéro de téléphone

# ERROR_MISSING_ROLE
source: No role was selected.
fr: SVP Choisir un rôle

# ERROR_MISSING_SUBM_FIRSTNAME
source: Please enter a Submitter First Name
fr: SVP Entrez le prénom du requérant

# ERROR_MISSING_SUBM_SURNAME
source: Please enter a Submitter Surname
fr: SVP Entrez le nom de famille du requérant

# ERROR_NOT_A_NUMBER
source: Numerical data only
fr: Données numériques seulement

# INVALID_CONFIRMATION
source: Confirmation code is not valid
fr: Le code de confirmation n'est pas valide.

source: Invalid Control Code
fr: Code de contrôle invalide

source: Invalid Debtor Surname
fr: Nom du débiteur invalide

# INVALID_LOGIN
source: Invalid Username provided
fr: Nom d'utilisateur fourni non valide.

# INVALID_LOGIN_EMAIL
source: Invalid Email associated with UserName
fr: Courriel associé au utilisateur non valide.

# INVALID_PASSWORD
source: Invalid Password provided
fr: Mot de passe fourni non valide.

# MAX_CONTROL_CODE_LENGTH
source: The maximum length of the control code is 6
fr: Le code de contrôle doit avoir une longueur maximale de 6 caractères.

# MISSING_BREACH
source: The particulars of the specified family provision breach must be specified
fr: Les renseignements sur l'infraction aux dispositions familiales doit être spécifié.

# MISSING_CATEGORY_CODE
source: The category code must be specified
fr: Le code de la catégorie de demande doit être spécifié.

# MISSING_CONTROL_CODE
source: The control code must be specified
fr: Le Le code de contrôle de la demande doit être spécifié.

# MISSING_CREDITOR_FIRST_NAME
source: The creditor first name must be specified
fr: Le prénom du créancier doit être spécifié.

# MISSING_CREDITOR_SURNAME
source: The creditor surname must be specified
fr: Le nom du créancier doit être spécifié.

# MISSING_DEBTOR_DOB
source: The debtor date of birth must be specified
fr: La date de naissance du débiteur doit être spécifié.

# MISSING_DEBTOR_FIRST_NAME
source: The debtor first name must be specified
fr: Le prénom du débiteur doit être spécifié.

# MISSING_DEBTOR_SURNAME
source: The debtor surname must be specified
fr: Le nom du débiteur doit être spécifié.

# MISSING_ENFSRV_CODE
source: The enforcement service code must be specified
fr: Le code du service d’exécution doit être spécifié.

# MISSING_FAMPRO
source: The family provision breach must be specified
fr: Le code d’infraction aux dispositions familiales doit être spécifié.

# MISSING_GENDER
source: The gender must be specified
fr: Le genre du débiteur doit être spécifié.

# MISSING_GROUP_BATCH_CODE
source: The group batch code must be specified
fr: Le code qui indique le lot doit être spécifié.

# MISSING_MEDIUM_CODE
source: The medium code must be specified
fr: Le support choisi pour la réception des réponses doit être spécifié.

# MISSING_RECIPIENT_SUBMITTER
source: The recipient submitter must be specified
fr: Le code du requérant autorisé au transfert du fichier électronique doit être spécifié.

# MISSING_SUBMITTER
source: The submitter must be specified
fr: Le code de requérant de l’émetteur de la demande doit être spécifié.

# REQUIRED_ALPHANUMERIC_CONTROL_CODE
source: The value specified for the reference code must be alphanumeric
fr: La valeur dans le code de contrôle doit être alphanumérique.

# WARNING_NO_DUTIES
source: No duties were selected
fr: Aucune tâche n'a été choisie
